## Aryo Adi Putro - 2341720084
## TI-3G

In [1]:
try:
  import gdown
except ImportError:
  !pip install gdown
  import gdown

gdown.download(id='1_drwRI2I8wLGNUgTRvmEZ-IAJJvCm8_5', output='Titanic-Dataset.csv', quiet=False)
gdown.download(id='1oKCPUN-nJ_EUKgLMLVEYWR47Qd8qBcXo', output='Titanic-Dataset-fixed.csv', quiet=False)
gdown.download(id='1zWjQID6M-z-XUK0dA3bB9bFfmw0SoJaZ', output='Titanic-Dataset-selected.csv', quiet=False)
gdown.download(id='1vpxNdBo2a7kPqEMIdmKi3IgSoWa2ifDb', output='lenna.png', quiet=False)

IMG_PATHS = ["Titanic-Dataset.csv", "Titanic-Dataset-fixed", "Titanic-Dataset-selected", "lenna.png"]

Downloading...
From: https://drive.google.com/uc?id=1_drwRI2I8wLGNUgTRvmEZ-IAJJvCm8_5
To: d:\AryokPunya\Kuliah\Tugas\smt5\ML\2341720084_ML_2025\JS03\Titanic-Dataset.csv
100%|██████████| 61.2k/61.2k [00:00<00:00, 554kB/s]
Downloading...
From: https://drive.google.com/uc?id=1oKCPUN-nJ_EUKgLMLVEYWR47Qd8qBcXo
To: d:\AryokPunya\Kuliah\Tugas\smt5\ML\2341720084_ML_2025\JS03\Titanic-Dataset-fixed.csv
100%|██████████| 67.8k/67.8k [00:00<00:00, 1.06MB/s]
Downloading...
From: https://drive.google.com/uc?id=1zWjQID6M-z-XUK0dA3bB9bFfmw0SoJaZ
To: d:\AryokPunya\Kuliah\Tugas\smt5\ML\2341720084_ML_2025\JS03\Titanic-Dataset-selected.csv
100%|██████████| 23.5k/23.5k [00:00<00:00, 917kB/s]
Downloading...
From: https://drive.google.com/uc?id=1vpxNdBo2a7kPqEMIdmKi3IgSoWa2ifDb
To: d:\AryokPunya\Kuliah\Tugas\smt5\ML\2341720084_ML_2025\JS03\lenna.png
100%|██████████| 474k/474k [00:00<00:00, 2.23MB/s]

In [2]:
import pandas as pd
import pandas as pd
import io
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import StandardScaler

In [3]:
dpath = 'Titanic-Dataset-fixed.csv'
df0 = pd.read_csv(dpath)
df0.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,DECK,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,DECK,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,DECK,S

In [4]:
# --- 2. Encoding fitur 'Sex' ---
df0['Sex'] = df0['Sex'].map({'male': 1, 'female': 0})
print("=== Hasil Setelah Encoding 'Sex' ===")
print(df0[['Sex']].head(), "\n")

=== Hasil Setelah Encoding 'Sex' ===
   Sex
0    1
1    0
2    0
3    0
4    1

In [5]:
# --- 3. Encoding fitur 'Cabin' ---
df0['Cabin'] = df0['Cabin'].fillna('Unknown')
print("=== Hasil Setelah Fill NaN pada 'Cabin' ===")
print(df0[['Cabin']].head(5), "\n")
df0['Cabin'] = df0['Cabin'].apply(lambda x: x[0] if x != 'Unknown' else 'U')
print("=== Hasil Ambil huruf pertama 'Cabin' (Deck) ===")
print(df0[['Cabin']].head(5), "\n")

=== Hasil Setelah Fill NaN pada 'Cabin' ===
  Cabin
0  DECK
1   C85
2  DECK
3  C123
4  DECK

=== Hasil Ambil huruf pertama 'Cabin' (Deck) ===
  Cabin
0     D
1     C
2     D
3     C
4     D

In [6]:
# --- 4. Standarisasi fitur 'Age' ---
df0['Age'] = df0[['Age']].fillna(df0['Age'].median())
print("=== Hasil Setelah Imputasi Data pada Usia dengan median ===")
print(df0[['Age']].head(10), "\n")

=== Hasil Setelah Imputasi Data pada Usia dengan median ===
         Age
0  22.000000
1  38.000000
2  26.000000
3  35.000000
4  35.000000
5  29.699118
6  54.000000
7   2.000000
8  27.000000
9  14.000000

In [7]:
scaler = StandardScaler()
df0['Age'] = scaler.fit_transform(df0[['Age']])
print("=== Hasil Setelah Standardisasi 'Age' ===")
print(df0[['Age']].head(10), "\n")

=== Hasil Setelah Standardisasi 'Age' ===
        Age
0 -0.592481
1  0.638789
2 -0.284663
3  0.407926
4  0.407926
5  0.000000
6  1.870059
7 -2.131568
8 -0.207709
9 -1.208115

In [8]:
# --- 5. Cek hasil akhir ---
print("=== Hasil Preprocessing (5 baris pertama) ===")
#print(df[['Sex', 'Cabin', 'Age']].head(5))
df0.head()

=== Hasil Preprocessing (5 baris pertama) ===

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,-0.592481,1,0,A/5 21171,7.2500,D,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,0.638789,1,0,PC 17599,71.2833,C,C
2,3,1,3,"Heikkinen, Miss. Laina",0,-0.284663,0,0,STON/O2. 3101282,7.9250,D,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,0.407926,1,0,113803,53.1000,C,S
4,5,0,3,"Allen, Mr. William Henry",1,0.407926,0,0,373450,8.0500,D,S

In [9]:
df0 = df0[['Survived', 'Pclass', 'Age', 'Sex', 'Cabin']]
df0.head()

   Survived  Pclass       Age  Sex Cabin
0         0       3 -0.592481    1     D
1         1       1  0.638789    0     C
2         1       3 -0.284663    0     D
3         1       1  0.407926    0     C
4         0       3  0.407926    1     D